big-yellow-duck/ESP32-Stereo-Audio-Visualizer-LED-Matrix-with-FreeRTOS/src/main.cpp
#include <Arduino.h>
#include <FastLED.h>
#include <SPI.h>
#include "ESP32_fft.h"

#define VSPI_MISO 19
#define VSPI_MOSI 23
#define VSPI_SCLK 18
#define VSPI_CS   5

#define FFT_N 512 //FFT SAMPLES to be used
#define SAMPLEFREQ 40000 //time taken to obtain 512 samples at 40,000Hz
#define noise_filter 

#define touch1 32
#define touch2 33
#define touch3 27

#define mapping_max_val 2000;

static const uint8_t max_brightness=190;
static const uint8_t min_brightness=2;

static TaskHandle_t normal_vis_handle, ISR_handler_handle, spi_handle, fill_white_lights_handle, fft_handle;
static TimerHandle_t touch1_timer, touch2_timer, touch3_timer, hue_timer, mapping_decay_timer, peak_decay_timer;

float fft_input_ch0[FFT_N]; //input array for fft calculations
float fft_input_ch1[FFT_N];
float fft_output_ch0[FFT_N];// fft output array
float fft_output_ch1[FFT_N];

typedef struct spi_out{
  float spi_out_ch0[FFT_N];
  float spi_out_ch1[FFT_N];
}spi_out;


typedef struct fft_out{
  uint_fast16_t post_process[2][10];
}fft_out;


ESP_fft fft_ch0(FFT_N, SAMPLEFREQ, FFT_REAL, FFT_FORWARD, fft_input_ch0, fft_output_ch0);
ESP_fft fft_ch1(FFT_N, SAMPLEFREQ, FFT_REAL, FFT_FORWARD, fft_input_ch1, fft_output_ch1);

uint16_t bands[10] = {1,3,6,13,20,26,32,40,52,64}; //78.125, 234.375, 468.75, 1015.625, 1562.5, 2031.25, 2500, 3125, 4062.5, 5000 (Frequencies to analyse)

uint16_t mapping_max =2000;

static const int spiClk =8000000; //8 MHZ SPI CLock

SPIClass *vspi = NULL;

static uint8_t received_ch0[2];
static uint8_t received_ch1[2];

//create queue to hold fft input buffer
QueueHandle_t fft_in_queue, fft_out_queue;


//define the pins that will be used to interface the components of the project
const uint8_t right_leds=16;
const uint8_t left_leds=17;
const uint8_t num_leds=60;
const uint8_t relay_pin=12;

//const uint16_t touch_threshold = 40;

bool touch1_active = false;
bool touch2_active = false;
bool touch3_active = false;
bool touch1_letgo = true;
bool touch2_letgo = true;
bool touch3_letgo = true;
bool short_press1 = true;
bool short_press2 = true;
bool short_press3 = true;
bool timer1_started = false;
bool timer2_started = false;
bool timer3_started = false;
bool long_press1 = true;
bool long_press2 = true;
bool long_press3 = true;

bool brightness_control_flag = false;
bool modePalette_control_flag = false;

static bool hue_timer_change_peiod_flag = false;

static int touch1_time, touch2_time, touch3_time;

uint8_t hue = 0;
uint8_t brightness = 60;
uint8_t column_height[2][10], peak_column_height[2][10];
uint8_t palette_index = 2;

//create the structure that will be be used to address the leds
static CRGB leds[2][num_leds];

DEFINE_GRADIENT_PALETTE(heat_colors){
  0,  0,0,255,
  127,255,0,0,
  255,255,255,40
};

CRGBPalette16 palettes_arr[] ={
  //standard rainbow palette
  RainbowColors_p,
  //bb palette 1
  CRGBPalette16(CRGB(255, 0, 84),
                CRGB(255, 0, 84),
                CRGB(60, 60, 255),
                CRGB(60, 60, 255),

                CRGB(75, 203, 246),
                CRGB(75, 203, 246),
                CRGB(255, 245, 50),
                CRGB(255, 245, 50),
                
                CRGB(255, 245, 50),
                CRGB(255, 245, 50),
                CRGB(75, 203, 246),
                CRGB(75, 203, 246),

                CRGB(60, 60, 255),
                CRGB(60, 60, 255),
                CRGB(255, 0, 84),
                CRGB(255, 0, 84)),
  //bb palette 2
  CRGBPalette16(CRGB(255, 0, 0),
                CRGB(255, 0, 0),
                CRGB(255, 100, 100),
                CRGB(255, 100, 100),

                CRGB(160, 20, 255),
                CRGB(160, 20, 255),
                CRGB(255, 230, 40),
                CRGB(255, 230, 40),
                
                CRGB(255, 230, 40),
                CRGB(255, 230, 40),
                CRGB(160, 20, 255),
                CRGB(160, 20, 255),

                CRGB(255, 100, 100),
                CRGB(255, 100, 100),
                CRGB(255, 0, 0),
                CRGB(255, 0, 0)),

  heat_colors            
};

/* sort the leds into rows and columns for easy addressing 
   there are 60 leds per channel for left and right,
   10 columns and 6 rows for each channel

*/
static uint8_t leds_arr[10][6];


void zero(uint8_t lr, uint8_t pos){
  for(uint8_t i=0; i<5; i++){
    leds[lr][leds_arr[0+pos][i]] = CHSV(0,0,brightness);
    leds[lr][leds_arr[2+pos][i]] = CHSV(0,0,brightness);
  }
  leds[lr][leds_arr[1+pos][4]] = CHSV(0,0,brightness);
  leds[lr][leds_arr[1+pos][0]] = CHSV(0,0,brightness);
}

void one(uint8_t lr, uint8_t pos){

  for(uint8_t i=0; i<5; i++){
    leds[lr][leds_arr[1+pos][i]] = CHSV(0,0,brightness);
  }
}

void two(uint8_t lr, uint8_t pos){
  if (lr == 0)
  {
    for(uint8_t i=0; i<3; i++){
      for(uint8_t j=0; j<5; j+=2){
        leds[lr][leds_arr[i+pos][j]] = CHSV(0,0,brightness);
      }
    }
    leds[lr][leds_arr[0+pos][3]] = CHSV(0,0,brightness);
    leds[lr][leds_arr[2+pos][1]] = CHSV(0,0,brightness);
  }
  else{
    for(uint8_t i=0; i<3; i++){
      for(uint8_t j=0; j<5; j+=2){
        leds[lr][leds_arr[i+pos][j]] = CHSV(0,0,brightness);
      }
    }
    leds[lr][leds_arr[0+pos][1]] = CHSV(0,0,brightness);
    leds[lr][leds_arr[2+pos][3]] = CHSV(0,0,brightness);
  }
}

void three(uint8_t lr, uint8_t pos){
  if (lr == 0)
  {
    for(uint8_t i=0; i<3; i++){
      for(uint8_t j=0; j<5; j+=2){
        leds[lr][leds_arr[i+pos][j]] = CHSV(0,0,brightness);
      }
    }
    leds[lr][leds_arr[0+pos][3]] = CHSV(0,0,brightness);
    leds[lr][leds_arr[0+pos][1]] = CHSV(0,0,brightness);
  }
  else{
    for(uint8_t i=0; i<3; i++){
      for(uint8_t j=0; j<5; j+=2){
        leds[lr][leds_arr[i+pos][j]] = CHSV(0,0,brightness);
      }
    }
    leds[lr][leds_arr[2+pos][1]] = CHSV(0,0,brightness);
    leds[lr][leds_arr[2+pos][3]] = CHSV(0,0,brightness);
  }
}

void four(uint8_t lr, uint8_t pos){
  if(lr ==0){
    for(uint8_t i=0; i<5; i++){
      leds[lr][leds_arr[0+pos][i]]= CHSV(0,0,brightness);
    }
    for(uint8_t j=4; j>1; j--){
      leds[lr][leds_arr[2+pos][j]]= CHSV(0,0,brightness);
    }
    leds[lr][leds_arr[1+pos][2]] = CHSV(0,0,brightness);
  }
  else{
    for(uint8_t i=0; i<5; i++){
      leds[lr][leds_arr[2+pos][i]]= CHSV(0,0,brightness);
    }
    for(uint8_t j=4; j>1; j--){
      leds[lr][leds_arr[0+pos][j]]= CHSV(0,0,brightness);
    }
    leds[lr][leds_arr[1+pos][2]] = CHSV(0,0,brightness);
  }
}

