big-yellow-duck/ESP32-Stereo-Audio-Visualizer-LED-Matrix-with-FreeRTOS/src/main.cpp
void five(uint8_t lr, uint8_t pos){
  if (lr == 0)
  {
    for(uint8_t i=0; i<3; i++){
      for(uint8_t j=0; j<5; j+=2){
        leds[lr][leds_arr[i+pos][j]] = CHSV(0,0,brightness);
      }
    }
    leds[lr][leds_arr[2+pos][3]] = CHSV(0,0,brightness);
    leds[lr][leds_arr[0+pos][1]] = CHSV(0,0,brightness);
  }
  else{
    for(uint8_t i=0; i<3; i++){
      for(uint8_t j=0; j<5; j+=2){
        leds[lr][leds_arr[i+pos][j]] = CHSV(0,0,brightness);
      }
    }
    leds[lr][leds_arr[2+pos][1]] = CHSV(0,0,brightness);
    leds[lr][leds_arr[0+pos][3]] = CHSV(0,0,brightness);
  }
}

void six(uint8_t lr, uint8_t pos){
  if(lr ==0){
    for(uint8_t i=0; i<6; i+=2){
      for(uint8_t j=0; j<3; j++){
        leds[lr][leds_arr[j+pos][i]]= CHSV(0,0,brightness);
      }
    }
    leds[lr][leds_arr[0+pos][1]] = CHSV(0,0,brightness);
    leds[lr][leds_arr[2+pos][1]] = CHSV(0,0,brightness);
    leds[lr][leds_arr[2+pos][3]] = CHSV(0,0,brightness);
  }
  else{
    for(uint8_t i=0; i<6; i+=2){
      for(uint8_t j=0; j<3; j++){
        leds[lr][leds_arr[j+pos][i]]= CHSV(0,0,brightness);
      }
    }
    leds[lr][leds_arr[2+pos][1]] = CHSV(0,0,brightness);
    leds[lr][leds_arr[0+pos][1]] = CHSV(0,0,brightness);
    leds[lr][leds_arr[0+pos][3]] = CHSV(0,0,brightness);
  }
}

void seven(uint8_t lr, uint8_t pos){
  if(lr ==0){
    for(uint8_t i=0; i<3; i++){
      leds[lr][leds_arr[i+pos][4]] = CHSV(0,0,brightness);
      leds[lr][leds_arr[i+pos][3-i]] = CHSV(0,0,brightness);
    }
    leds[lr][leds_arr[2+pos][0]] = CHSV(0,0,brightness);
  }
  else{
    for(uint8_t i=0; i<3; i++){
      leds[lr][leds_arr[i+pos][4]] = CHSV(0,0,brightness);
      leds[lr][leds_arr[i+pos][1+i]] = CHSV(0,0,brightness);
    }
    leds[lr][leds_arr[0+pos][0]] = CHSV(0,0,brightness);
  }
}

void eight(uint8_t lr, uint8_t pos){
  for(uint8_t i=0; i<3; i++){
    for(uint8_t j=0; j<5; j++){
    leds[lr][leds_arr[i+pos][j]] =CHSV(0,0,brightness);
    }
  }
  leds[lr][leds_arr[1+pos][1]]= CHSV(0,0,0);
  leds[lr][leds_arr[1+pos][3]]= CHSV(0,0,0);
}

void nine(uint8_t lr, uint8_t pos){
  if(lr ==0){
    for(uint8_t i=0; i<6; i+=2){
      for(uint8_t j=0; j<3; j++){
        leds[lr][leds_arr[j+pos][i]]= CHSV(0,0,brightness);
      }
    }
    leds[lr][leds_arr[0+pos][3]] = CHSV(0,0,brightness);
    leds[lr][leds_arr[2+pos][3]] = CHSV(0,0,brightness);
    leds[lr][leds_arr[0+pos][1]] = CHSV(0,0,brightness);
  }
  else{
    for(uint8_t i=0; i<6; i+=2){
      for(uint8_t j=0; j<3; j++){
        leds[lr][leds_arr[j+pos][i]]= CHSV(0,0,brightness);
      }
    }
    leds[lr][leds_arr[2+pos][3]] = CHSV(0,0,brightness);
    leds[lr][leds_arr[0+pos][3]] = CHSV(0,0,brightness);
    leds[lr][leds_arr[2+pos][1]] = CHSV(0,0,brightness);
  }
}

//function to clear 1 array of leds
void clear_leds(uint8_t led_arr_lr){
  fill_solid(leds[led_arr_lr],num_leds,CHSV(0,0,0));
  FastLED.show();
}

void fill_white_lights(){
  fill_solid(leds[0],num_leds,CHSV(0,0,brightness));
  fill_solid(leds[1],num_leds,CHSV(0,0,brightness));
  FastLED.show();
}
//function to display numbers on wither side of the led array
void number_display(bool left_pos){
  String number_str;
  if (left_pos){
    clear_leds(0);
    number_str = (String) brightness;
    for(uint8_t i=0; i<=number_str.length(); i++){
      switch (number_str[i])
      {
        case '0':
          zero(0,6-i*3);
          break;
        case '1':
          one(0,6-i*3);
          break;
        case '2':
          two(0,6-i*3);
          break;
        case '3':
          three(0,6-i*3);
          break;
        case '4':
          four(0,6-i*3);
          break;
        case '5':
          five(0,6-i*3);
          break;
        case '6':
          six(0,6-i*3);
          break;
        case '7':
          seven(0,6-i*3);
          break;
        case '8':
          eight(0,6-i*3);
          break;
        case '9':
          nine(0,6-i*3);
          break;
      }
    }
  }
  else{
    clear_leds(1);
    number_str = (String) brightness;
    for(uint8_t i=0; i<number_str.length(); i++){
      switch (number_str[i])
      {
        case '0':
          zero(1,i*3);
          break;
        case '1':
          one(1,i*3);
          break;
        case '2':
          two(1,i*3);
          break;
        case '3':
          three(1,i*3);
          break;
        case '4':
          four(1,i*3);
          break;
        case '5':
          five(1,i*3);
          break;
        case '6':
          six(1,i*3);
          break;
        case '7':
          seven(1,i*3);
          break;
        case '8':
          eight(1,i*3);
          break;
        case '9':
          nine(1,i*3);
          break;
      }
    }
  }
  FastLED.show();
}

void brightness_control(uint8_t choice){
  uint8_t *p_brightness = &brightness;
  switch(choice){
    //show brightness controls for case 0
    case 0:
      for(uint8_t i=0; i<2; i++){
        for(uint8_t j=0; j<10; j++){
          for(uint8_t k=0; k<6; k++){
            leds[i][leds_arr[j][k]]=CRGB(0,0,0);
          }
      }
      }
      for(uint8_t l=2; l<8; l++){
        for(uint8_t m=2; m<4; m++){
          leds[0][leds_arr[l][m]] =CHSV(0,0,brightness);
          leds[1][leds_arr[l][m]] =CHSV(0,0,brightness);
        }
      }
      for(uint8_t n=4; n<6; n++){
        for(uint8_t o=0; o<6; o++){
          leds[1][leds_arr[n][o]] = CHSV(0,0,brightness);
        }
      }
      FastLED.show();
      break;
    // increase brigtness by 1 and show brightness value `on the left
    case 1:
      brightness +=2;
      if(brightness>max_brightness){
        brightness = max_brightness;
      }
      clear_leds(1);
      for(uint8_t l=2; l<8; l++){
        for(uint8_t m=2; m<4; m++){
          leds[1][leds_arr[l][m]] = CHSV(0,0,brightness);
        }
      }
      for(uint8_t n=4; n<6; n++){
        for(uint8_t o=0; o<6; o++){
          leds[1][leds_arr[n][o]] = CHSV(0,0,brightness);
        }
      }
      number_display(true);
      break;
    // decrease brightness by 2 and show brighness value on the right.
    case 2:
      brightness -=2;
      if (brightness<min_brightness){
        brightness = min_brightness;
      }
      clear_leds(0);
      for(uint8_t l=2; l<8; l++){
        for(uint8_t m=2; m<4; m++){
          leds[0][leds_arr[l][m]] =CHSV(0,0,brightness);
        }
      }
      number_display(false);
      break;
  }
}

void mode_palette_control(uint8_t choice){
  clear_leds(0);
  clear_leds(1);
  
  switch (choice)
  {
  case 0:
    for(uint8_t j=0; j<10; j++){
      if(j == 9 or j == 7 or j == 6 or j == 4 or j== 3){
      for(uint8_t i=0; i<5; i++){
        leds[0][leds_arr[j][i]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
        }
      }
      if(j == 8){
        leds[0][leds_arr[j][3]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
      }
      if(j == 5 or j == 2){
        leds[0][leds_arr[j][4]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
        leds[0][leds_arr[j][0]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
      }
      if(j == 1){
        leds[0][leds_arr[j][1]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
        leds[0][leds_arr[j][2]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
        leds[0][leds_arr[j][3]] = ColorFromPalette(palettes_arr[2], j*9 + hue, brightness, LINEARBLEND);
      }
    }  

