big-yellow-duck/ESP32-Stereo-Audio-Visualizer-LED-Matrix-with-FreeRTOS/src/main.cpp
    for(uint8_t i=0; i<10; i++){
      if(i == 0 or i == 6){
        for(uint8_t j=0; j<5; j++){
          leds[1][leds_arr[i][j]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
        }
      }
      if(i == 1){
        leds[1][leds_arr[i][4]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
        leds[1][leds_arr[i][2]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
      }
      if(i == 2){
        leds[1][leds_arr[i][4]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
        leds[1][leds_arr[i][3]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
        leds[1][leds_arr[i][2]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
      }
      if(i == 3 or i == 5){
        leds[1][leds_arr[i][0]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
        leds[1][leds_arr[i][1]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
        leds[1][leds_arr[i][2]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
        leds[1][leds_arr[i][3]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
      }
      if(i == 4){
        leds[1][leds_arr[i][4]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
        leds[1][leds_arr[i][2]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
      }
      if(i ==7 or i == 8){
        leds[1][leds_arr[i][0]] = ColorFromPalette(palettes_arr[2], i*9 + hue, brightness, LINEARBLEND);
      }
    }

  break;
  
  case 1:

  break;
  default:
    break;
  }
  nblendPaletteTowardPalette(palettes_arr[2],palettes_arr[palette_index],70);
  FastLED.show();
}
void timer1_callback(TimerHandle_t pxTimer){
  timer1_started = true;
  brightness_control(0);
  brightness_control_flag = false;
  Serial.println("timer1 tick");
}

void timer3_callback(TimerHandle_t pxTimer){
  timer3_started = true;
  brightness_control(1);
  Serial.println("timer 3 tick");
}

void timer2_callback(TimerHandle_t pxTimer){
  timer2_started = true;
  brightness_control(2);
  Serial.println("timer 2 tick");
}

uint8_t touch_reader(){
  uint_fast8_t bin1, bin2, bin3;
  uint_fast8_t touch_out;
  if (touchRead(touch1)<=40){
    bin1 = B100;
    if(touch1_letgo){
      touch1_time = millis();
      touch1_letgo = false;
      short_press1 = true;
      long_press1 = true;
    }
  }
  else{
    bin1 = B0;
    touch1_letgo = true;
  }
  if(touchRead(touch2)<=40){
    bin2 = B010;
    if(touch2_letgo){
      touch2_time = millis();
      touch2_letgo = false;
      short_press2 = true;
      long_press2 = true;
    }
  }
  else{
    bin2 = B0;
    touch2_letgo = true;
  }
  if(touchRead(touch3)<40){
    bin3 = B001;
    if(touch3_letgo){
      touch3_time = millis();
      touch3_letgo = false;
      short_press3 = true;
      long_press3 = true;
    }
  }
  else{
    bin3 = B0;
    touch3_letgo = true;
  }
  touch_out = bin1 + bin2 + bin3;
  return touch_out;
}

void touch_func(void* parameters){
  uint8_t touch_reading;
  uint8_t first_touch_val;
  bool first_touch_flag = true;
  bool suspend_flag = false;
  bool white_lights = false;
  bool speaker_on = true;
  while(1){
    if(first_touch_flag ==true and touch_reader()>0){
      first_touch_val = touch_reader();
      first_touch_flag = false;
      Serial.print("first touch val: ");
      Serial.println(first_touch_val,BIN);
     }
    switch (first_touch_val)
    {
    case B100:
      //brightness controls
      touch_reading = touch_reader();
      vTaskSuspend(normal_vis_handle);
      vTaskSuspend(spi_handle);
      vTaskSuspend(fft_handle);
      suspend_flag =true;
      switch (touch_reading){
        case B100:
          // if brightness was changed before coming here, wait 500ms before showing default -+ menu
          if (brightness_control_flag == true){
            if(timer1_started == false){
              xTimerStart(touch1_timer,0);
              timer1_started = true;
              Serial.println("timer1 started");
            }
            if(timer2_started){
              xTimerStop(touch2_timer,0);
              timer2_started = false;
            }
            if(timer3_started){
              xTimerStop(touch3_timer,0);
              timer3_started = false;
            }
          }
          else{
            brightness_control(0);
          }
        break;
          
        case B101:
          if (timer1_started){
            xTimerStop(touch1_timer,0);
            timer1_started = false;
            Serial.println("timer1 stopped");
          }
          if(timer2_started){
            xTimerStop(touch2_timer,0);
            timer2_started = false;
          }
          if(millis()-touch3_time<1000){
            Serial.print("touch3 time: ");
            Serial.println((millis()-touch3_time));
            if(short_press3){
              brightness_control(1);
              short_press3 = false;
              Serial.println("short press 3");
            }
          }
          if(millis()-touch3_time>=1000){
            if(timer3_started == false){
              timer3_started = true;
              xTimerStart(touch3_timer, 0);
              Serial.println(brightness);
            }
          }
          brightness_control_flag = true;
        break;

        case B110:
          if(timer1_started){
            xTimerStop(touch1_timer,0);
            timer1_started = false;
          }
          if(timer3_started){
            xTimerStop(touch3_timer,0);
            timer3_started =false;
          }
          if(millis()-touch2_time<1000){
            Serial.print("touch2 time: ");
            Serial.println((millis()-touch2_time));
            if(short_press2){
              brightness_control(2);
              short_press2 = false;
              Serial.println("short press 2");
            }
          }
          if(millis()-touch2_time>=1000){
            if(timer2_started == false){
              timer2_started = true;
              xTimerStart(touch2_timer, 0);
              Serial.println(brightness);
            }
          }
          brightness_control_flag = true;
        break;

        default:
          Serial.println("exit first_touch B100 menu");
          if(timer1_started){
            xTimerStop(touch1_timer,0);
            timer1_started = false;
          }
          if(timer2_started){
            xTimerStop(touch2_timer,0);
            timer2_started = false;
          }
          if(timer3_started){
            xTimerStop(touch3_timer,0);
            timer3_started = false;
          }
          if(white_lights){
            fill_white_lights();
          }
          brightness_control_flag = false;
          first_touch_val = 0;
          first_touch_flag = true;
        break;
      }
    break;

    case B010:
      // mode and palette controls
      // disable mode and palette controls when white lights are on
      if(white_lights){
        Serial.println("white lights enabled mode and pal controls disabled");
        modePalette_control_flag = false;
        first_touch_val = 0;
        first_touch_flag = true;
        break;
      }
      touch_reading = touch_reader();
      vTaskSuspend(normal_vis_handle);
      vTaskSuspend(spi_handle);
      vTaskSuspend(fft_handle);
      suspend_flag =true;
      switch (touch_reading)
      {
      case B010:
      //speed up palette hue increment in menu to view palettes better
        if(hue_timer_change_peiod_flag == false){
          xTimerChangePeriod(hue_timer, pdTICKS_TO_MS(20), 0);
          hue_timer_change_peiod_flag = true;
        }
        mode_palette_control(0);
      break;
      
      case B110:
        
      break;

      case B011:
        if(short_press3){
          short_press3 = false;
          if(palette_index<3){
            palette_index +=1;
          }
          else{
            palette_index = 0;
          }
          modePalette_control_flag = true;
          }
        if(short_press3 == false){
          mode_palette_control(0);
        }
        Serial.print("palette index: ");
        Serial.println(palette_index);
      break;

      default:
        Serial.println("exit first touch B010 menu");
        modePalette_control_flag = false;
        first_touch_val = 0;
        first_touch_flag = true;
        //change the hue increment timer back to original after closing mode and palette menu
        if(hue_timer_change_peiod_flag == true){
          xTimerChangePeriod(hue_timer, pdTICKS_TO_MS(80), 0);
          hue_timer_change_peiod_flag = false;
        }
 
      break;
      }
    break;

    case B001:
      //white lights and speaker on off controls
      touch_reading = touch_reader();
      vTaskSuspend(normal_vis_handle);
      vTaskSuspend(spi_handle);
      vTaskSuspend(fft_handle);
      suspend_flag =true;
      switch (touch_reading){
        case B111:
          //turn of visualizer for white light, touch and hold longer to turn of speaker amplifier but keep lights on
          if (millis()-touch1_time<3000 and millis()-touch2_time<3000){
              if(short_press1 and short_press2 and short_press3){
                short_press1 = short_press2 = short_press3 = false;
                white_lights = !white_lights;
                if(white_lights){
                  vTaskDelay(1);
                  fill_white_lights();
                  Serial.println("white light on"); 
                }
                else{
                  Serial.println("white light off");
                }
              }
          }
          if (millis()-touch1_time>3000 and millis()-touch2_time>3000){
            if(long_press1 and long_press2 and long_press3){
              long_press1 = long_press2 = long_press3 = false;
              speaker_on = !speaker_on;
              Serial.println("toggle speakers");
              if(speaker_on){
                digitalWrite(relay_pin,LOW);
                Serial.println("speaker_on");
              }
              if(speaker_on != true){
                digitalWrite(relay_pin,HIGH);
                Serial.println("speaker off");
              }
            }
          }
        break;

