big-yellow-duck/ESP32-Stereo-Audio-Visualizer-LED-Matrix-with-FreeRTOS/src/main.cpp
        case B000:
          first_touch_val = 0;
          first_touch_flag = true;
        break;

        default:
        break;
      }
    break;

    default:
      first_touch_val = 0;
      first_touch_flag = true;
      break;
    }
    
    if(suspend_flag and touch_reader() == 0){
      if(white_lights != true){
        vTaskResume(normal_vis_handle);
        vTaskResume(spi_handle);
        vTaskResume(fft_handle);
      suspend_flag = false;
      }
    
    FastLED.show();
      
    }
    vTaskDelay(10/portTICK_PERIOD_MS);
  }
}

void hue_callback(TimerHandle_t pxTimer){
  //increment the hue every 65 milliseconds
  hue+=2;
  
}

void mapping_decay_callback(TimerHandle_t pxTimer){
  if (mapping_max >=900)
  {
    mapping_max -= 100;
  }
}

void peak_decay_callback(TimerHandle_t pxTimer){
  //decay the peak column height every 70 milliseconds
  for(uint8_t i=0; i<10; i++){
    if(peak_column_height[0][i]!=0){
      peak_column_height[0][i] -=1;
    }
    if (peak_column_height[1][i]!=0){
      peak_column_height[1][i] -=1;
    }
  }
}
//0x70 = B11100000
//0x60 = B11000000

void spi(void* parameters){
  uint8_t *p_received_ch0, *p_received_ch1;
  p_received_ch0 = received_ch0;
  p_received_ch1 = received_ch1;

  float *p_fft_input_ch0, *p_fft_input_ch1;
  p_fft_input_ch0 = fft_input_ch0;
  p_fft_input_ch1 = fft_input_ch1;
 
  spi_out fft_buf;
  while(1){
    int spiTime = micros();
    int oldTime;
    const uint8_t send_ch0= B11100000;
    const uint8_t send_ch1= B11000000;
    for(uint_fast16_t i=0; i<FFT_N; i++){
      oldTime =micros();
      vspi ->beginTransaction(SPISettings(spiClk, MSBFIRST, SPI_MODE0));
      //take ADC reading for channel 0
      digitalWrite(VSPI_CS, LOW);
      p_received_ch0[0]= vspi->transfer(send_ch0);
      p_received_ch0[1]= vspi->transfer(0);
      digitalWrite(VSPI_CS, HIGH);
      // take readin for channel 1
      digitalWrite(VSPI_CS, LOW);
      p_received_ch1[0]= vspi->transfer(send_ch1);
      p_received_ch1[1]= vspi->transfer(0);
      digitalWrite(VSPI_CS, HIGH);
      vspi ->endTransaction();

      fft_buf.spi_out_ch0[i]= word(p_received_ch0[0], p_received_ch0[1]);
      fft_buf.spi_out_ch1[i]= word(p_received_ch1[0], p_received_ch1[1]);
      //take a sample every 25 microseconds to get a sample rate of 40,000Hz
      while (micros()-oldTime<25){
      
      }
  }
    if (xQueueSend(fft_in_queue, (void *)&fft_buf, 1/portTICK_PERIOD_MS) !=pdPASS){
      Serial.println("fft input queue buffer full");
    }
    else{
      Serial.println("sent for processing");
    }
  }
}

void fft(void* paramerters){
  while(1){
    spi_out fft_buf_received;
    fft_out processed_buf, old_processed_buf;

    float *p_fft_input_ch0, *p_fft_input_ch1;
    p_fft_input_ch0 = fft_input_ch0;
    p_fft_input_ch1 = fft_input_ch1;

    float *p_fft_output_ch0, *p_fft_output_ch1;
    p_fft_output_ch0 = fft_output_ch0;
    p_fft_output_ch1 = fft_output_ch1;

    if(xQueueReceive(fft_in_queue, (void *)&fft_buf_received, 1/portTICK_PERIOD_MS) ==pdPASS){
      for (uint_fast16_t i = 0; i < FFT_N; i++){
        p_fft_input_ch0[i] = fft_buf_received.spi_out_ch0[i];
        p_fft_input_ch1[i] = fft_buf_received.spi_out_ch1[i];
      } 
      //fft magic
      fft_ch0.removeDC();
      fft_ch0.hammingWindow();
      fft_ch0.execute();
      fft_ch0.complexToMagnitude();

      fft_ch1.removeDC();
      fft_ch1.hammingWindow();
      fft_ch1.execute();
      fft_ch1.complexToMagnitude();  

      //process fft output
      p_fft_output_ch0[bands[0]]-=60;
      p_fft_output_ch1[bands[0]]-=60;

      for(uint8_t f=0; f<2; f++){
        for(uint8_t i=0; i<10; i++){
          if(f==0){
            processed_buf.post_process[f][i] = (uint_fast16_t) p_fft_output_ch0[bands[i]];
          }
          else{
            processed_buf.post_process[f][i] = (uint_fast16_t) p_fft_output_ch1[bands[i]];
          }
        }
      }

      for(uint8_t f=0; f<2;f++){
        for (uint8_t i=0; i< 10; i++) {

          //slow down falling of lights
          if (processed_buf.post_process[f][i] < old_processed_buf.post_process[f][i]){
            processed_buf.post_process[f][i] = (processed_buf.post_process[f][i] + old_processed_buf.post_process[f][i])/2; 
          }
          
          //filter out noise picked up by fft
          if (processed_buf.post_process[f][i]>100 and processed_buf.post_process[f][i]<10000){
            if(i==0){
              processed_buf.post_process[f][i] *=0.9;
            }
            if(i==1){
              processed_buf.post_process[f][i] *=0.9;
            }
            //amplify the last 3 bands after filtering to make it more visible
            if(i == 7){
              processed_buf.post_process[f][i] *=1.08;
            }
            if(i == 8){
              processed_buf.post_process[f][i] *=1.08;
            }
            if(i == 9){
              processed_buf.post_process[f][i] *=1.08;
            }
          }
          else{
            processed_buf.post_process[f][i]=0;
          }
          
          old_processed_buf.post_process[f][i] = processed_buf.post_process[f][i];
        }
      }
      if(xQueueSend(fft_out_queue, (void*)&processed_buf, 0) == pdPASS){
        Serial.println("fft and post processing done");
      }
      else{
        Serial.println("processed output buf full");
      }
    }
  }
}

void normal_vis(void* parameters){
  while(1){
    fft_out  processed_buf_received;
    
    uint8_t (*p_column_height)[10], (*p_peak_column_height)[10];
    p_column_height = column_height;
    p_peak_column_height = peak_column_height;

    uint8_t (*p_leds_arr)[6];
    p_leds_arr = leds_arr;

    uint16_t *p_mapping_max;
    p_mapping_max = &mapping_max;

    CRGB (*p_leds)[num_leds];
    p_leds = leds;

    // process the fft output received from the queue to display lights
    if(xQueueReceive(fft_out_queue, (void *)&processed_buf_received, 0) == pdPASS){
      Serial.println("processed output received");
      // standard 10 band visualizer output 
      for(uint8_t f=0; f<2; f++){
        for (uint8_t i = 0; i < 10; i++){
          if (processed_buf_received.post_process[f][i] >= *p_mapping_max)
            {
              *p_mapping_max +=35;
            }
          p_column_height[f][i] = map(processed_buf_received.post_process[f][i], 120, *p_mapping_max, 0, 5);

          if(p_peak_column_height[f][i] <= p_column_height[f][i]){
            p_peak_column_height[f][i] = p_column_height[f][i];
          }
          
