big-yellow-duck/ESP32-Stereo-Audio-Visualizer-LED-Matrix-with-FreeRTOS/src/main.cpp
          for(int j=0; j<=p_peak_column_height[f][i]; j++){
            p_leds[f][p_leds_arr[i][j]]= ColorFromPalette(palettes_arr[palette_index], i*5+ hue, brightness, LINEARBLEND );
          }
          
          for(int k=5; k>p_peak_column_height[f][i]; k--){
            p_leds[f][p_leds_arr[i][k]]=CHSV(0,0,0);
          }
        }
      }
      FastLED.show();
    }
    else{
      Serial.println("waiting for processing");
      vTaskDelay(5/portTICK_PERIOD_MS);
    }
  }
}

void setup(){
  fft_in_queue = xQueueCreate(2, sizeof(spi_out));
  fft_out_queue = xQueueCreate(2,sizeof(fft_out));

  Serial.begin(115200);
  pinMode(relay_pin, OUTPUT); 
  pinMode(33, INPUT);

  vspi = new SPIClass(VSPI);
  vspi->begin(VSPI_SCLK, VSPI_MISO, VSPI_MOSI, VSPI_CS);
  pinMode(VSPI_CS, OUTPUT);
  // assign the arrays that can be processed to output the led colors.
  FastLED.addLeds<WS2812, left_leds, GRB>(leds[0], num_leds);
  FastLED.addLeds<WS2812, right_leds, GRB>(leds[1], num_leds);
  FastLED.setCorrection(TypicalSMD5050);

  uint8_t led_num =0;
  for(int i=0; i<10; i++){
    if(i%2 ==0 || i==0){
      for(int j=5;j>=0;j--){
        leds_arr[i][j]=led_num;
        led_num++;
      }
    }
    else{
      for(int k=0;k<=5;k++){
        leds_arr[i][k]=led_num;
        led_num++;
      }
    }   
  }
  
  xTaskCreatePinnedToCore(spi,"spi",6000,NULL,1,&spi_handle,1);
  xTaskCreate(fft, "fft", 6200, NULL, 1, &fft_handle);
  xTaskCreate(normal_vis,"normal_vis",2000,NULL,1,&normal_vis_handle);
  xTaskCreate(touch_func,"touch_func", 1500, NULL, 1, &ISR_handler_handle);

  // create timers to manage time routine tasks
  touch1_timer = xTimerCreate("touch1_timer", pdMS_TO_TICKS(3000), pdFALSE, (void*)1, timer1_callback);
  touch3_timer = xTimerCreate("touch3_timer", pdMS_TO_TICKS(200), pdTRUE, (void*)3 , timer3_callback);
  touch2_timer = xTimerCreate("touch2_timer", pdMS_TO_TICKS(200), pdTRUE, (void*)2, timer2_callback);
  hue_timer = xTimerCreate("hue_timer", pdMS_TO_TICKS(80), pdTRUE, (void*)4, hue_callback);
  mapping_decay_timer = xTimerCreate("mapping_decay", pdMS_TO_TICKS(250), pdTRUE, (void*)5, mapping_decay_callback);
  peak_decay_timer = xTimerCreate("peak_decay_timer", pdMS_TO_TICKS(70), pdTRUE, (void*)6, peak_decay_callback);

  xTimerStart(hue_timer, 0);
  xTimerStart(mapping_decay_timer, 0);
  xTimerStart(peak_decay_timer, 0);

  vTaskDelete(NULL);
}

void loop(){
    vTaskDelete(NULL);
  }
 
 